pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
/* OpenSprinkler Unified (AVR/RPI/BBB/LINUX) Firmware
 * Copyright (C) 2015 by Ray Wang (ray@opensprinkler.com)
 *
 * Server functions
 * Feb 2015 @ OpenSprinkler.com
 *
 * This file is part of the OpenSprinkler library
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see
 * <http://www.gnu.org/licenses/>.
 */

#include "OpenSprinkler.h"
#include "OpenSprinklerProgram.h"

#ifdef SG21
  #include "SensorGroup.h"
#endif
// External variables defined in main ion file
#if defined(ARDUINO)
#if defined(ESP8266) || defined(ESP32)
#undef DB_MASK
#define DB_MASK 2
#ifndef SDFAT
#ifdef ESP8266
#include <FS.h>
#elif defined(ESP32)
#include <SPIFFS.h>
#else 
#include <SD.h>
#include <SdFat.h>
extern SdFat sd;
#endif
#endif
#endif
#if !defined(ESP8266) && !defined(ESP32)
#include <avr/eeprom.h>
#else
#ifdef EEPROM_ESP
#include "Eeprom_ESP.h"
#else
#include "eeprom_mio.h"
#endif  //EEPROM_ESP
#endif

static uint8_t ntpclientportL = 8888; // Default NTP client port
extern ulong flow_count;

#else

#include <stdarg.h>
#include <stdlib.h>
#include "etherport.h"
#include "server.h"

extern char ether_buffer[];
extern EthernetClient *m_client;

#endif
extern DS1307RTC RTC;
extern BufferFiller bfill;
extern char tmp_buffer[];
extern OpenSprinkler os;
extern ProgramData pd;

#ifdef OPENSPRINKLER_ARDUINO
	extern char op_json_names[];
	extern char op_max[];
#else
	extern char op_json_names[];
	extern char op_max[];
#endif
#ifdef SG21

extern SensorGroup sensors;	//SensorGroup object
#endif
void write_log ( byte type, ulong curr_time );
void schedule_all_stations ( ulong curr_time );
void turn_off_station ( byte sid, ulong curr_time );
void process_dynamic_events ( ulong curr_time );
void check_network ( time_t curr_time );
void check_weather ( time_t curr_time );
void perform_ntp_sync ( time_t curr_time );
void log_statistics ( time_t curr_time );
void delete_log ( char *name );
void reset_all_stations_immediate();
void reset_all_stations();
void make_logfile_name ( char *name );
int available_ether_buffer();

// Define return error code
#define HTML_OK                0x00
#define HTML_SUCCESS           0x01
#define HTML_UNAUTHORIZED      0x02
#define HTML_MISMATCH          0x03
#define HTML_DATA_MISSING      0x10
#define HTML_DATA_OUTOFBOUND   0x11
#define HTML_DATA_FORMATERROR  0x12
#define HTML_RFCODE_ERROR      0x13
#define HTML_PAGE_NOT_FOUND    0x20
#define HTML_NOT_PERMITTED     0x30
#define HTML_REDIRECT_HOME     0xFF

static prog_uchar html200OK[] /*PROGMEM*/ =
    "HTTP/1.1 200 OK\r\n"
    ;

static prog_uchar htmlCacheCtrl[] /*PROGMEM*/ =
    "Cache-Control: max-age=604800, public\r\n"
    ;

static prog_uchar htmlNoCache[] /*PROGMEM*/ =
    "Cache-Control: max-age=0, no-cache, no-store, must-revalidate\r\n"
    ;

static prog_uchar htmlContentHTML[] /*PROGMEM*/ =
    "Content-Type: text/html\r\n"
    ;

static prog_uchar htmlAccessControl[] /*PROGMEM*/ =
    "Access-Control-Allow-Origin: *\r\n"
    ;

static prog_uchar htmlContentJSON[] /*PROGMEM*/ =
    "Content-Type: application/json\r\n"
    "Connection: close\r\n"
    ;

static unsigned char htmlMobileHeader[] /*PROGMEM*/ =
    "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1.0,minimum-scale=1.0,user-scalable=no\">\r\n"
    ;

static unsigned char htmlReturnHome[] /*PROGMEM*/ =
    "<script>window.location=\"/\";</script>\n"
    ;

extern const char wtopts_filename[];
extern const char stns_filename[];

#if defined(ARDUINO)
void print_html_standard_header()
{
    bfill.emit_p ( PSTR ( "$F$F$F$F\r\n" ), html200OK, htmlContentHTML, htmlNoCache, htmlAccessControl );
}

void print_json_header ( bool bracket=true )
{
    bfill.emit_p ( PSTR ( "$F$F$F$F\r\n" ), html200OK, htmlContentJSON, htmlAccessControl, htmlNoCache );
    if ( bracket ) bfill.emit_p ( PSTR ( "{" ) );
}

byte findKeyVal ( const char *str,char *strbuf, uint8_t maxlen,const char *key,bool key_in_pgm=false,uint8_t *keyfound=NULL )
{
    uint8_t found=0;
    uint8_t i=0;
    const char *kp;
    kp=key;
    if ( key_in_pgm )
    {
        // key is in program memory space
        while ( *str &&  *str!=' ' && *str!='\n' && found==0 )
        {
            if ( *str == pgm_read_byte ( kp ) )
            {
                kp++;
                if ( pgm_read_byte ( kp ) == '\0' )
                {
                    str++;
                    kp=key;
                    if ( *str == '=' )
                    {
                        found=1;
                    }
                }
            }
            else
            {
                kp=key;
            }
            str++;
        }
    }
    else
    {
        while ( *str &&  *str!=' ' && *str!='\n' && found==0 )
        {
            if ( *str == *kp )
            {
                kp++;
                if ( *kp == '\0' )
                {
                    str++;
                    kp=key;
                    if ( *str == '=' )
                    {
                        found=1;
                    }
                }
            }
            else
            {
                kp=key;
            }
            str++;
        }
    }
    if ( found==1 )
    {
        // copy the value to a buffer and terminate it with '\0'
        while ( *str &&  *str!=' ' && *str!='\n' && *str!='&' && i<maxlen-1 )
        {
            *strbuf=*str;
            i++;
            str++;
            strbuf++;
        }
        *strbuf='\0';
    }
    // return the length of the value
    if ( keyfound ) *keyfound = found;
    return ( i );
}

void rewind_ether_buffer()
{
    bfill = ether.tcpOffset();
}

void send_packet ( bool final=false )
{
	DEBUG_PRINT(" P="); DEBUG_PRINTLN((char*)bfill.buffer());
    if ( final )
    {
        ether.httpServerReply_with_flags ( bfill.position(), TCP_FLAGS_ACK_V|TCP_FLAGS_FIN_V );
    }
    else
    {
        ether.httpServerReply_with_flags ( bfill.position(), TCP_FLAGS_ACK_V );
        bfill=ether.tcpOffset();
    }
}

/* Check available space (number of bytes) in the Ethernet buffer */
int available_ether_buffer()
{
    return ETHER_BUFFER_SIZE - ( int ) bfill.position();
}

#else
void print_html_standard_header()
{
    m_client->write ( ( const uint8_t * ) html200OK, strlen ( html200OK ) );
    m_client->write ( ( const uint8_t * ) htmlContentHTML, strlen ( htmlContentHTML ) );
    m_client->write ( ( const uint8_t * ) htmlNoCache, strlen ( htmlNoCache ) );
    m_client->write ( ( const uint8_t * ) htmlAccessControl, strlen ( htmlAccessControl ) );
    m_client->write ( ( const uint8_t * ) "\r\n", 2 );
}

void print_json_header ( bool bracket=true )
{
    m_client->write ( ( const uint8_t * ) html200OK, strlen ( html200OK ) );
    m_client->write ( ( const uint8_t * ) htmlContentJSON, strlen ( htmlContentJSON ) );
    m_client->write ( ( const uint8_t * ) htmlNoCache, strlen ( htmlNoCache ) );
    m_client->write ( ( const uint8_t * ) htmlAccessControl, strlen ( htmlAccessControl ) );
    if ( bracket ) m_client->write ( ( const uint8_t * ) "\r\n{", 3 );
    else m_client->write ( ( const uint8_t * ) "\r\n", 2 );
}

byte findKeyVal ( const char *str,char *strbuf, uint8_t maxlen,const char *key,bool key_in_pgm=false,uint8_t *keyfound=NULL )
{
    uint8_t found=0;
    uint8_t i=0;
    const char *kp;
    kp=key;
    while ( *str &&  *str!=' ' && *str!='\n' && found==0 )
    {
        if ( *str == *kp )
        {
            kp++;
            if ( *kp == '\0' )
            {
                str++;
                kp=key;
                if ( *str == '=' )
                {
                    found=1;
                }
            }
        }
        else
        {
            kp=key;
        }
        str++;
    }
    if ( found==1 )
    {
        // copy the value to a buffer and terminate it with '\0'
        while ( *str &&  *str!=' ' && *str!='\n' && *str!='&' && i<maxlen-1 )
        {
            *strbuf=*str;
            i++;
            str++;
            strbuf++;
        }
        *strbuf='\0';
    }
    // return the length of the value
    if ( keyfound ) *keyfound = found;
    return ( i );
}


void BufferFiller::emit_p ( const char *fmt, ... )
{
    va_list ap;
    va_start ( ap, fmt );
    for ( ;; )
    {
        char c = *fmt++;
        if ( c == 0 )
            break;
        if ( c != '$' )
        {
            *ptr++ = c;
            continue;
        }
        c = *fmt++;
        switch ( c )
        {
        case 'D':
            itoa ( va_arg ( ap, int ), ( char* ) ptr, 10 ); // ray
            break;
        case 'L':
            ultoa ( va_arg ( ap, long ), ( char* ) ptr, 10 ); // ray
            break;
        case 'S':
        case 'F':
            strcpy ( ( char* ) ptr, va_arg ( ap, const char* ) );
            break;
        case 'E':
        {
            byte* s = va_arg ( ap, byte* );
            char d;
            while ( ( d = nvm_read_byte ( s++ ) ) != 0 )
                *ptr++ = d;
            continue;
        }
        default:
            *ptr++ = c;
            continue;
        }
        ptr += strlen ( ( char* ) ptr );
    }
    * ( ptr ) =0;
    va_end ( ap );
}

void rewind_ether_buffer()
{
    bfill = ether_buffer;
}

void send_packet ( bool final=false )
{
    m_client->write ( ( const uint8_t * ) ether_buffer, strlen ( ether_buffer ) );
    if ( final )
        m_client->stop();
    else
        rewind_ether_buffer();
}

