pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
int available_ether_buffer()
{
    return ETHER_BUFFER_SIZE - ( int ) bfill.position();
}
#endif

#ifdef OPENSPRINKLER_ARDUINO // n.b. h2int is also already defined in ethercard->webutil.cpp
/** Convert a single hex digit character to its integer value */
unsigned char h2int_arduino ( char c )
{
    if ( c >= '0' && c <='9' )
    {
        return ( ( unsigned char ) c - '0' );
    }
    if ( c >= 'a' && c <='f' )
    {
        return ( ( unsigned char ) c - 'a' + 10 );
    }
    if ( c >= 'A' && c <='F' )
    {
        return ( ( unsigned char ) c - 'A' + 10 );
    }
    return ( 0 );
}
#endif // OPENSPRINKLER_ARDUINO

/** Decode a url string e.g "hello%20joe" or "hello+joe" becomes "hello joe" */
void urlDecode ( char *urlbuf )
{
    char c;
    char *dst = urlbuf;
    while ( ( c = *urlbuf ) != 0 )
    {
        if ( c == '+' ) c = ' ';
        if ( c == '%' )
        {
            c = *++urlbuf;
#ifdef OPENSPRINKLER_ARDUINO
            c = ( h2int_arduino ( c ) << 4 ) | h2int_arduino ( *++urlbuf );
#else
            c = ( h2int ( c ) << 4 ) | h2int ( *++urlbuf );
#endif // OPENSPRINKLER_ARDUINO
        }
        *dst++ = c;
        urlbuf++;
    }
    *dst = '\0';
}

/** Check and verify password */
boolean check_password ( char *p )
{
    if ( os.options[OPTION_IGNORE_PASSWORD] )  return true;
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "pw" ), true ) )
    {
        urlDecode ( tmp_buffer );
		DEBUG_PRINT("pass="); DEBUG_PRINTLN(tmp_buffer);
        if ( os.password_verify ( tmp_buffer ) )
            return true;
    }
    return false;
}

void server_json_stations_attrib ( const char* name, int addr )
{
    byte *attrib = ( byte* ) tmp_buffer;
    os.station_attrib_bits_load ( addr, attrib );
    bfill.emit_p ( PSTR ( "\"$F\":[" ), name );
    for ( byte i=0; i<os.nboards; i++ )
    {
        bfill.emit_p ( PSTR ( "$D" ), attrib[i] );
        if ( i!=os.nboards-1 )
            bfill.emit_p ( PSTR ( "," ) );
    }
    bfill.emit_p ( PSTR ( "]," ) );
}

void server_json_stations_main()
{
    server_json_stations_attrib ( PSTR ( "masop" ), ADDR_NVM_MAS_OP );
    server_json_stations_attrib ( PSTR ( "ignore_rain" ), ADDR_NVM_IGNRAIN );
    server_json_stations_attrib ( PSTR ( "masop2" ), ADDR_NVM_MAS_OP_2 );
    server_json_stations_attrib ( PSTR ( "stn_dis" ), ADDR_NVM_STNDISABLE );
    server_json_stations_attrib ( PSTR ( "stn_seq" ), ADDR_NVM_STNSEQ );
#ifdef SG21
  server_json_stations_attrib(PSTR("stn_as1"), ADDR_NVM_SSENSOR_1);  // attach soil sensor1 status on station
  server_json_stations_attrib(PSTR("stn_as2"), ADDR_NVM_SSENSOR_2);  // attach soil sensor2 status on station
#endif
#if defined(ARDUINO)  // only output stn_spe if it's supported
    if ( os.status.has_sd )
    {
        server_json_stations_attrib ( PSTR ( "stn_spe" ), ADDR_NVM_STNSPE );
    }
#else
    server_json_stations_attrib ( PSTR ( "stn_spe" ), ADDR_NVM_STNSPE );
#endif
    bfill.emit_p ( PSTR ( "\"snames\":[" ) );
    byte sid;
    for ( sid=0; sid<os.nstations; sid++ )
    {
        os.get_station_name ( sid, tmp_buffer );
        bfill.emit_p ( PSTR ( "\"$S\"" ), tmp_buffer );
        if ( sid!=os.nstations-1 )
            bfill.emit_p ( PSTR ( "," ) );
        if ( available_ether_buffer() <80 )
        {
            send_packet();
        }
    }
    bfill.emit_p ( PSTR ( "],\"maxlen\":$D}" ), STATION_NAME_SIZE );
    delay ( 1 );
}

/** Output stations data */
byte server_json_stations ( char *p )
{
    print_json_header();
    server_json_stations_main();
    return HTML_OK;
}

/** Output station special attribute */
byte server_json_station_special ( char *p )
{
#if defined(ARDUINO)
    // if no sd card, return false
    if ( !os.status.has_sd )  return HTML_PAGE_NOT_FOUND;
#endif
    byte sid;
    byte comma=0;
    int stepsize=sizeof ( StationSpecialData );
    StationSpecialData *stn = ( StationSpecialData * ) tmp_buffer;
    print_json_header();
    for ( sid=0; sid<os.nstations; sid++ )
    {
        if ( os.station_attrib_bits_read ( ADDR_NVM_STNSPE+ ( sid>>3 ) ) & ( 1<< ( sid&0x07 ) ) )
        {
            read_from_file ( stns_filename, ( char* ) stn, stepsize, sid*stepsize );
            if ( comma ) bfill.emit_p ( PSTR ( "," ) );
            else
            {
                comma=1;
            }
            bfill.emit_p ( PSTR ( "\"$D\":{\"st\":$D,\"sd\":\"$S\"}" ), sid, stn->type, stn->data );
        }
    }
    bfill.emit_p ( PSTR ( "}" ) );
    delay ( 1 );
    return HTML_OK;
}

void server_change_stations_attrib ( char *p, char header, int addr )
{
    byte attrib[MAX_EXT_BOARDS+1];
    os.station_attrib_bits_load ( addr, attrib );
    char tbuf2[3] = {0, 0, 0};
    byte bid;
    tbuf2[0]=header;
    for ( bid=0; bid<os.nboards; bid++ )
    {
        itoa ( bid, tbuf2+1, 10 );
        if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, tbuf2 ) )
        {
            attrib[bid] = atoi ( tmp_buffer );
        }
    }
    os.station_attrib_bits_save ( addr, attrib );
}

/**
 * Change Station Name and Attributes
 * Command: /cs?pw=xxx&s?=x&m?=x&i?=x&n?=x&d?=x
 *
 * pw: password
 * s?: station name (? is station index, starting from 0)
 * m?: master operation bit field (? is board index, starting from 0)
 * i?: ignore rain bit field
 * n?: master2 operation bit field
 * d?: disable sation bit field
 * q?: station sequeitnal bit field
 * p?: station special flag bit field
 */
byte server_change_stations ( char *p )
{
    byte sid;
    char tbuf2[4] = {'s', 0, 0, 0};
    // process station names
    for ( sid=0; sid<os.nstations; sid++ )
    {
        itoa ( sid, tbuf2+1, 10 );
        if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, tbuf2 ) )
        {
            urlDecode ( tmp_buffer );
            os.set_station_name ( sid, tmp_buffer );
        }
    }

    server_change_stations_attrib ( p, 'm', ADDR_NVM_MAS_OP ); // master1
    server_change_stations_attrib ( p, 'i', ADDR_NVM_IGNRAIN ); // ignore rain
    server_change_stations_attrib ( p, 'n', ADDR_NVM_MAS_OP_2 ); // master2
    server_change_stations_attrib ( p, 'd', ADDR_NVM_STNDISABLE ); // disable
    server_change_stations_attrib ( p, 'q', ADDR_NVM_STNSEQ ); // sequential
#ifdef SG21

  char tbuf3[2] = {5,0};   //soil sensor 1 attached to s0, s2, bx0101010101, bx1010101010
    nvm_write_block(tbuf3, (void *)ADDR_NVM_SSENSOR_1, strlen(tbuf3));
  char tbuf4[2] = {6,0};  //soil sensor 2 attached to s1, s3, bx1010101010, bx0101010101
    nvm_write_block(tbuf4, (void *)ADDR_NVM_SSENSOR_2, strlen(tbuf4));
#endif
#if defined(ARDUINO)  // only parse station special bits if it's supported
    if ( os.status.has_sd )
    {
        server_change_stations_attrib ( p, 'p', ADDR_NVM_STNSPE ); // special
    }
#else
    server_change_stations_attrib ( p, 'p', ADDR_NVM_STNSPE ); // special
#endif
    /* handle special data */
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "sid" ), true ) )
    {
        sid = atoi ( tmp_buffer );
        if ( sid<0 || sid>os.nstations ) return HTML_DATA_OUTOFBOUND;
        if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "st" ), true ) &&
                findKeyVal ( p, tmp_buffer+1, TMP_BUFFER_SIZE, PSTR ( "sd" ), true ) )
        {
            int stepsize=sizeof ( StationSpecialData );
            tmp_buffer[0]-='0';
            tmp_buffer[stepsize-1] = 0;
            write_to_file ( stns_filename, tmp_buffer, strlen ( tmp_buffer )+1, stepsize*sid, false );
        }
        else
        {
            return HTML_DATA_MISSING;
        }
    }
    return HTML_SUCCESS;
}

