pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
/** Parse one number from a comma separate list */
uint16_t parse_listdata ( char **p )
{
    char* pv;
    int i=0;
    tmp_buffer[i]=0;
    // copy to tmp_buffer until a non-number is encountered
    for ( pv= ( *p ); pv< ( *p )+10; pv++ )
    {
        if ( ( *pv ) =='-' || ( *pv ) =='+' || ( ( *pv ) >='0'&& ( *pv ) <='9' ) )
            tmp_buffer[i++] = ( *pv );
        else
            break;
    }
    tmp_buffer[i]=0;
    *p = pv+1;
    return ( uint16_t ) atol ( tmp_buffer );
}
#ifdef OS217
void manual_start_program(byte, byte);
/**
 * Change run-once program
 * Command: /cr?pw=xxx&t=[x,x,x...]
 *
 * pw: password
 * t:  station water time
 */
byte server_manual_program(char *p) {
  if (!findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("pid"), true))
    return HTML_DATA_MISSING;

  int pid=atoi(tmp_buffer);
  if (pid < 0 || pid >= pd.nprograms) {
    return HTML_DATA_OUTOFBOUND;
  }

  byte uwt = 0;
  if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("uwt"), true)) {
    if(tmp_buffer[0]=='1') uwt = 1;
  }

  // reset all stations and prepare to run one-time program
  reset_all_stations_immediate();

  manual_start_program(pid+1, uwt);

  return HTML_SUCCESS;

}
#endif

byte server_change_runonce ( char *p )
{
    // decode url first
    urlDecode ( p );
    // search for the start of v=[
    char *pv;
    boolean found=false;
    for ( pv=p; ( *pv ) !=0 && pv<p+100; pv++ )
    {
        if ( strncmp ( pv, "t=[", 3 ) ==0 )
        {
            found=true;
            break;
        }
    }
    if ( !found )  return HTML_DATA_MISSING;
    pv+=3;

    // reset all stations and prepare to run one-time program
    reset_all_stations_immediate();

    byte sid, bid, s;
    uint16_t dur;
    boolean match_found = false;
    for ( sid=0; sid<os.nstations; sid++ )
    {
        dur=parse_listdata ( &pv );
        bid=sid>>3;
        s=sid&0x07;
        // if non-zero duration is given
        // and if the station has not been disabled
        if ( dur>0 && ! ( os.station_attrib_bits_read ( ADDR_NVM_STNDISABLE+bid ) & ( 1<<s ) ) )
        {
            RuntimeQueueStruct *q = pd.enqueue();
            if ( q )
            {
                q->st = 0;
                q->dur = water_time_resolve ( dur );
                q->pid = 254;
                q->sid = sid;
                match_found = true;
            }
        }
    }
    if ( match_found )
    {
        schedule_all_stations ( os.now_tz() );
        return HTML_SUCCESS;
    }

    return HTML_DATA_MISSING;
}


/**
 * Delete a program
 * Command: /dp?pw=xxx&pid=xxx
 *
 * pw: password
 * pid:program index (-1 will delete all programs)
 */
byte server_delete_program ( char *p )
{
    if ( !findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "pid" ), true ) )
        return HTML_DATA_MISSING;

    int pid=atoi ( tmp_buffer );
    if ( pid == -1 )
    {
        pd.eraseall();
    }
    else if ( pid < pd.nprograms )
    {
        pd.del ( pid );
    }
    else
    {
        return HTML_DATA_OUTOFBOUND;
    }

    return HTML_SUCCESS;
}

/**
 * Move up a program
 * Command: /up?pw=xxx&pid=xxx
 *
 * pw:  password
 * pid: program index (must be 1 or larger, because we can't move up program 0)
*/
byte server_moveup_program ( char *p )
{
    if ( !findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "pid" ), true ) )
    {
        return HTML_DATA_MISSING;
    }
    int pid=atoi ( tmp_buffer );
    if ( ! ( pid>=1 && pid< pd.nprograms ) ) return HTML_DATA_OUTOFBOUND;

    pd.moveup ( pid );

    return HTML_SUCCESS;
}

/**
 * Change a program
 * Command: /cp?pw=xxx&pid=x&v=[flag,days0,days1,[start0,start1,start2,start3],[dur0,dur1,dur2..]]&name=x
 *
 * pw:    password
 * pid:   program index
 * flag:  program flag
 * start?:up to 4 start times
 * dur?:  station water time
 * name:  program name
*/
static char _str_program[] /*PROGMEM*/ = "Program ";
byte server_change_program ( char *p )
{
    byte i;

    ProgramStruct prog;

    // parse program index
    if ( !findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "pid" ), true ) )
    {
        return HTML_DATA_MISSING;
    }
    int pid=atoi ( tmp_buffer );
    if ( ! ( pid>=-1 && pid< pd.nprograms ) ) return HTML_DATA_OUTOFBOUND;

    // parse program name
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "name" ), true ) )
    {
        urlDecode ( tmp_buffer );
        strncpy ( prog.name, tmp_buffer, PROGRAM_NAME_SIZE );
    }
    else
    {
        strcpy_P ( prog.name, _str_program );
        itoa ( ( pid==-1 ) ? ( pd.nprograms+1 ) : ( pid+1 ), prog.name+8, 10 );
    }

    // do a full string decoding
    urlDecode ( p );

    // parse ad-hoc v=[...
    // search for the start of v=[
    char *pv;
    boolean found=false;

    for ( pv=p; ( *pv ) !=0 && pv<p+100; pv++ )
    {
        if ( strncmp ( pv, "v=[", 3 ) ==0 )
        {
            found=true;
            break;
        }
    }

    if ( !found )  return HTML_DATA_MISSING;
    pv+=3;
    // parse headers
    * ( char* ) ( &prog ) = parse_listdata ( &pv );
    prog.days[0]= parse_listdata ( &pv );
    prog.days[1]= parse_listdata ( &pv );
    // parse start times
    pv++; // this should be a '['
    for ( i=0; i<MAX_NUM_STARTTIMES; i++ )
    {
        prog.starttimes[i] = parse_listdata ( &pv );
    }
    pv++; // this should be a ','
    pv++; // this should be a '['
    for ( i=0; i<os.nstations; i++ )
    {
        uint16_t pre = parse_listdata ( &pv );
#ifdef OS217
    prog.durations[i] = pre;
#else
        prog.durations[i] = water_time_encode ( pre );
#endif
	}
    pv++; // this should be a ']'
    pv++; // this should be a ']'
    // parse program name

    // i should be equal to os.nstations at this point
    for ( ; i<MAX_NUM_STATIONS; i++ )
    {
        prog.durations[i] = 0;     // clear unused field
    }

    // process interval day remainder (relative-> absolute)
    if ( prog.type == PROGRAM_TYPE_INTERVAL && prog.days[1] > 1 )
    {
        pd.drem_to_absolute ( prog.days );
    }

    if ( pid==-1 )
    {
        if ( !pd.add ( &prog ) )
            return HTML_DATA_OUTOFBOUND;
    }
    else
    {
        if ( !pd.modify ( pid, &prog ) )
            return HTML_DATA_OUTOFBOUND;
    }
    return HTML_SUCCESS;
}

void server_json_options_main()
{
    byte oid;
    for ( oid=0; oid<NUM_OPTIONS; oid++ )
    {
#if !defined(ARDUINO) // do not send the following parameters for non-Arduino platforms
        if ( oid==OPTION_USE_NTP     || oid==OPTION_USE_DHCP    ||
                oid==OPTION_STATIC_IP1  || oid==OPTION_STATIC_IP2  || oid==OPTION_STATIC_IP3  || oid==OPTION_STATIC_IP4  ||
                oid==OPTION_GATEWAY_IP1 || oid==OPTION_GATEWAY_IP2 || oid==OPTION_GATEWAY_IP3 || oid==OPTION_GATEWAY_IP4 )
            continue;
#endif
        int32_t v=os.options[oid];
#ifdef OS217
    if (oid==OPTION_MASTER_OFF_ADJ || oid==OPTION_MASTER_OFF_ADJ_2 ||
        oid==OPTION_MASTER_ON_ADJ  || oid==OPTION_MASTER_ON_ADJ_2 ||
        oid==OPTION_STATION_DELAY_TIME) {
#else
        if ( oid==OPTION_MASTER_OFF_ADJ || oid==OPTION_MASTER_OFF_ADJ_2 )
        {
            v-=60;
        }
        if ( oid==OPTION_STATION_DELAY_TIME )
        {
#endif 
            v=water_time_decode_signed ( v );
        }
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
        if ( oid==OPTION_BOOST_TIME )
        {
            if ( os.hw_type==HW_TYPE_AC ) continue;
            else v<<=2;
        }
#else
        if ( oid==OPTION_BOOST_TIME ) continue;
#endif

