pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
        if ( oid==OPTION_SEQUENTIAL_RETIRED ) continue;
        if ( oid==OPTION_DEVICE_ID && os.status.has_hwmac ) continue; // do not send DEVICE ID if hardware MAC exists
        // each json name takes 5 characters
        strncpy_P0 ( tmp_buffer, op_json_names+oid*5, 5 );
        bfill.emit_p ( PSTR ( "\"$S\":$D" ),
                       tmp_buffer, v );
        if ( oid!=NUM_OPTIONS-1 )
            bfill.emit_p ( PSTR ( "," ) );
    }

    bfill.emit_p ( PSTR ( ",\"dexp\":$D,\"mexp\":$D,\"hwt\":$D}" ), os.detect_exp(), MAX_EXT_BOARDS, os.hw_type );
    delay ( 1 );
}

/** Output Options */
byte server_json_options ( char *p )
{
    print_json_header();
    server_json_options_main();
    return HTML_OK;
}

void server_json_programs_main()
{
    bfill.emit_p ( PSTR ( "\"nprogs\":$D,\"nboards\":$D,\"mnp\":$D,\"mnst\":$D,\"pnsize\":$D,\"pd\":[" ),
                   pd.nprograms, os.nboards, MAX_NUMBER_PROGRAMS, MAX_NUM_STARTTIMES, PROGRAM_NAME_SIZE );
    byte pid, i;
    ProgramStruct prog;
    for ( pid=0; pid<pd.nprograms; pid++ )
    {
        pd.read ( pid, &prog );
        if ( prog.type == PROGRAM_TYPE_INTERVAL && prog.days[1] > 1 )
        {
            pd.drem_to_relative ( prog.days );
        }

        byte bytedata = * ( char* ) ( &prog );
        bfill.emit_p ( PSTR ( "[$D,$D,$D,[" ), bytedata, prog.days[0], prog.days[1] );
        // start times data
        for ( i=0; i< ( MAX_NUM_STARTTIMES-1 ); i++ )
        {
            bfill.emit_p ( PSTR ( "$D," ), prog.starttimes[i] );
        }
        bfill.emit_p ( PSTR ( "$D],[" ), prog.starttimes[i] ); // this is the last element
        // station water time
        for ( i=0; i<os.nstations-1; i++ ) {
#ifdef OS217
       bfill.emit_p(PSTR("$L,"),(unsigned long)prog.durations[i]);
        }
       bfill.emit_p(PSTR("$L],\""),(unsigned long)prog.durations[i]); // this is the last element
#else
			bfill.emit_p(PSTR("$L,"), (unsigned long)water_time_decode(prog.durations[i]));
	     }
        bfill.emit_p ( PSTR ( "$L],\"" ), ( unsigned long ) water_time_decode ( prog.durations[i] ) ); // this is the last element
#endif
																								   // program name
        strncpy ( tmp_buffer, prog.name, PROGRAM_NAME_SIZE );
        tmp_buffer[PROGRAM_NAME_SIZE] = 0;  // make sure the string ends
        bfill.emit_p ( PSTR ( "$S" ), tmp_buffer );
        if ( pid!=pd.nprograms-1 )
        {
            bfill.emit_p ( PSTR ( "\"]," ) );
        }
        else
        {
            bfill.emit_p ( PSTR ( "\"]" ) );
        }
        // push out a packet if available
        // buffer size is getting small
        if ( available_ether_buffer() < 250 )
        {
            send_packet();
        }
    }
    bfill.emit_p ( PSTR ( "]}" ) );
    delay ( 1 );
}

/** Output program data */
byte server_json_programs ( char *p )
{
    print_json_header();
    server_json_programs_main();
    return HTML_OK;
}

/** Output script url form */
byte server_view_scripturl ( char *p )
{
    print_html_standard_header();
    bfill.emit_p ( PSTR ( "<form name=of action=cu method=get><table cellspacing=\"12\"><tr><td><b>JavaScript</b>:</td><td><input type=text size=40 maxlength=40 value=\"$E\" name=jsp></td></tr><tr><td>Default:</td><td>$S</td></tr><tr><td><b>Weather</b>:</td><td><input type=text size=40 maxlength=40 value=\"$E\" name=wsp></td></tr><tr><td>Default:</td><td>$S</td></tr><tr><td><b>Password</b>:</td><td><input type=password size=32 name=pw> <input type=submit></td></tr></table></form><script src=https://ui.opensprinkler.com/js/hasher.js></script>" ), ADDR_NVM_JAVASCRIPTURL, DEFAULT_JAVASCRIPT_URL, ADDR_NVM_WEATHERURL, DEFAULT_WEATHER_URL );
    return HTML_OK;
}

extern ulong flow_count;
void server_json_controller_main()
{
    byte bid, sid;
    ulong curr_time = os.now_tz();
    //os.nvm_string_get(ADDR_NVM_LOCATION, tmp_buffer);
    bfill.emit_p ( PSTR ( "\"devt\":$L,\"nbrd\":$D,\"en\":$D,\"rd\":$D,\"rs\":$D,\"rdst\":$L,"
                          "\"loc\":\"$E\",\"wtkey\":\"$E\",\"sunrise\":$D,\"sunset\":$D,\"eip\":$L,\"lwc\":$L,\"lswc\":$L,"
                          "\"lrun\":[$D,$D,$D,$L]," ),
                   curr_time,
                   os.nboards,
                   os.status.enabled,
                   os.status.rain_delayed,
                   os.status.rain_sensed,
                   os.nvdata.rd_stop_time,
                   ADDR_NVM_LOCATION,
                   ADDR_NVM_WEATHER_KEY,
                   os.nvdata.sunrise_time,
                   os.nvdata.sunset_time,
                   os.nvdata.external_ip,
                   os.checkwt_lasttime,
                   os.checkwt_success_lasttime,
                   pd.lastrun.station,
                   pd.lastrun.program,
                   pd.lastrun.duration,
                   pd.lastrun.endtime );

#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
    if ( os.status.has_curr_sense )
    {
        bfill.emit_p ( PSTR ( "\"curr\":$D," ), os.read_current() );
    }
#endif
#ifdef SG21
	if (os.options[OPTION_FSENSOR_TYPE] == SENSOR_TYPE_FLOW) {
		bfill.emit_p(PSTR("\"flcrt\":$L,\"flwrt\":$D,"), sensors.window_impulses, FLOWCOUNT_RT_WINDOW);
	}
#else
    if ( os.options[OPTION_SENSOR_TYPE]==SENSOR_TYPE_FLOW )
    {
        bfill.emit_p ( PSTR ( "\"flcrt\":$L,\"flwrt\":$D," ), os.flowcount_rt, FLOWCOUNT_RT_WINDOW );
    }
#endif
#ifdef BATTERY
	bfill.emit_p(PSTR("\"batmV\":$D,\"batmA\":$D,\"batCh\":$D,"),
		os.BatteryVoltage(), os.BatteryAmps(),os.BatteryCharge());
#endif
    bfill.emit_p ( PSTR ( "\"sbits\":[" ) );
    // print sbits
    for ( bid=0; bid<os.nboards; bid++ )
        bfill.emit_p ( PSTR ( "$D," ), os.station_bits[bid] );
    bfill.emit_p ( PSTR ( "0],\"ps\":[" ) );
    // print ps
    for ( sid=0; sid<os.nstations; sid++ )
    {
        unsigned long rem = 0;
        byte qid = pd.station_qid[sid];
        RuntimeQueueStruct *q = pd.queue + qid;
        if ( qid<255 )
        {
            rem = ( curr_time >= q->st ) ? ( q->st+q->dur-curr_time ) : q->dur;
            if ( rem>65535 ) rem = 0;
        }
        bfill.emit_p ( PSTR ( "[$D,$L,$L]" ), ( qid<255 ) ?q->pid:0, rem, ( qid<255 ) ?q->st:0 );
        bfill.emit_p ( ( sid<os.nstations-1 ) ?PSTR ( "," ) :PSTR ( "]" ) );

        // if available ether buffer is getting small
        // send out a packet
        if ( available_ether_buffer() < 80 )
        {
            send_packet();
        }
    }

