pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
    if ( read_from_file ( wtopts_filename, tmp_buffer ) )
	{
		DEBUG_PRINT("wto="); DEBUG_PRINTLN(tmp_buffer);
        bfill.emit_p ( PSTR ( ",\"wto\":{$S}" ), tmp_buffer );
    }
    bfill.emit_p ( PSTR ( "}" ) );
    delay ( 1 );
}

/** Output controller variables in json */
byte server_json_controller ( char *p )
{
    print_json_header();
    server_json_controller_main();
    return HTML_OK;
}

/** Output homepage */
byte server_home()
{
    print_html_standard_header();
    bfill.emit_p ( PSTR ( "<!DOCTYPE html>\n<html>\n<head>\n$F</head>\n<body>\n<script>" ), htmlMobileHeader );

    // send server variables and javascript packets
    bfill.emit_p ( PSTR ( "var ver=$D,ipas=$D;</script>\n" ),
                   OS_FW_VERSION, os.options[OPTION_IGNORE_PASSWORD] );
    bfill.emit_p ( PSTR ( "<script src=\"$E/home.js\"></script>\n</body>\n</html>" ), ADDR_NVM_JAVASCRIPTURL );
    return HTML_OK;
}

/**
 * Change controller variables
 * Command: /cv?pw=xxx&rsn=x&rbt=x&en=x&rd=x&sl=x
 *
 * pw:  password
 * rsn: reset all stations (0 or 1)
 * rbt: reboot controller (0 or 1)
 * en:  enable (0 or 1)
 * rd:  rain delay hours (0 turns off rain delay)
 * re:  remote extension mode
 * update: launch update script (for OSPi/OSBo/Linux only)
 */

byte server_change_values ( char *p )
{
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "rsn" ), true ) )
    {
        reset_all_stations();
    }

#ifndef ARDUINO
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "update" ), true ) && atoi ( tmp_buffer ) > 0 )
    {
        //bfill.emit_p(PSTR("Updating..."));
        os.update_dev();
    }
#endif

#define TIME_REBOOT_DELAY  20
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "rbt" ), true ) && atoi ( tmp_buffer ) > 0 )
    {
        print_html_standard_header();
        //bfill.emit_p(PSTR("Rebooting..."));
        send_packet ( true );
        os.reboot_dev();
    }

    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "en" ), true ) )
    {
        if ( tmp_buffer[0]=='1' && !os.status.enabled )  os.enable();
        else if ( tmp_buffer[0]=='0' &&  os.status.enabled )  os.disable();
    }

    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "rd" ), true ) )
    {
        int rd = atoi ( tmp_buffer );
        if ( rd>0 )
        {
            os.nvdata.rd_stop_time = os.now_tz() + ( unsigned long ) rd * 3600;
            os.raindelay_start();
        }
        else if ( rd==0 )
        {
            os.raindelay_stop();
        }
        else  return HTML_DATA_OUTOFBOUND;
    }

    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "re" ), true ) )
    {
        if ( tmp_buffer[0]=='1' && !os.options[OPTION_REMOTE_EXT_MODE] )
        {
            os.options[OPTION_REMOTE_EXT_MODE] = 1;
            os.options_save();
        }
        else if ( tmp_buffer[0]=='0' && os.options[OPTION_REMOTE_EXT_MODE] )
        {
            os.options[OPTION_REMOTE_EXT_MODE] = 0;
            os.options_save();
        }
    }
    return HTML_SUCCESS;
}

// remove spaces from a string
void string_remove_space ( char *src )
{
    char *dst = src;
    while ( 1 )
    {
        if ( *src != ' ' )
        {
            *dst++ = *src;
        }
        if ( *src == 0 ) break;
        src++;
    }
}

/**
 * Change script url
 * Command: /cu?pw=xxx&jsp=x
 *
 * pw:  password
 * jsp: Javascript path
 */
byte server_change_scripturl ( char *p )
{
#if defined(DEMO)
    return HTML_REDIRECT_HOME;
#endif
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "jsp" ), true ) )
    {
        urlDecode ( tmp_buffer );
        tmp_buffer[MAX_JAVASCRIPTURL]=0;  // make sure we don't exceed the maximum size
        // trim unwanted space characters
        string_remove_space ( tmp_buffer );
        nvm_write_block ( tmp_buffer, ( void * ) ADDR_NVM_JAVASCRIPTURL, strlen ( tmp_buffer )+1 );
    }
    if ( findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "wsp" ), true ) )
    {
        urlDecode ( tmp_buffer );
        tmp_buffer[MAX_WEATHERURL]=0;
        string_remove_space ( tmp_buffer );
        nvm_write_block ( tmp_buffer, ( void * ) ADDR_NVM_WEATHERURL, strlen ( tmp_buffer )+1 );
    }
    return HTML_REDIRECT_HOME;
}

/**
 * Change options
 * Command: /co?pw=xxx&o?=x&loc=x&wtkey=x&ttt=x
 *
 * pw:  password
 * o?:  option name (? is option index)
 * loc: location
 * wtkey: weather underground api key
 * ttt: manual time (applicable only if ntp=0)
 */
byte server_change_options(char *p) {
	// temporarily save some old options values
	bool time_change = false;
	bool weather_change = false;
	bool network_change = false;

	// !!! p and bfill share the same buffer, so don't write
	// to bfill before you are done analyzing the buffer !!!
	// process option values
	byte err = 0;
	byte prev_value;
	byte max_value;
	for (byte oid = 0; oid < NUM_OPTIONS; oid++) {
		//if ((os.options[oid].flag&OPFLAG_WEB_EDIT)==0) continue;

		// skip options that cannot be set through /co command
		if (oid == OPTION_RESET || oid == OPTION_DEVICE_ENABLE ||
			oid == OPTION_FW_VERSION || oid == OPTION_HW_VERSION ||
			oid == OPTION_FW_MINOR || oid == OPTION_SEQUENTIAL_RETIRED ||
			oid == OPTION_REMOTE_EXT_MODE)
			continue;
		prev_value = os.options[oid];
		max_value = pgm_read_byte(op_max + oid);
		if (max_value == 1)  os.options[oid] = 0; // set a bool variable to 0 first
		char tbuf2[5] = { 'o', 0, 0, 0, 0 };
		itoa(oid, tbuf2 + 1, 10);
		if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, tbuf2)) {
			if (max_value == 1) {
				os.options[oid] = 1;  // if the bool variable is detected, set to 1
			} else {
				int32_t v = atol(tmp_buffer);
#ifdef OS217
		    if (oid==OPTION_MASTER_OFF_ADJ || oid==OPTION_MASTER_OFF_ADJ_2 ||
		        oid==OPTION_MASTER_ON_ADJ  || oid==OPTION_MASTER_ON_ADJ_2  ||
		        oid==OPTION_STATION_DELAY_TIME) {
		      v=water_time_encode_signed(v);
#else
				if (oid == OPTION_MASTER_OFF_ADJ || oid == OPTION_MASTER_OFF_ADJ_2) {
					v += 60;   // master off time
				}
				if (oid == OPTION_STATION_DELAY_TIME) {
					v = water_time_encode_signed((int16_t)v);
#endif
				} // encode station delay time
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
				if (os.hw_type == HW_TYPE_DC && oid == OPTION_BOOST_TIME) {
					v >>= 2;
				}
#endif
				if (v >= 0 && v <= max_value) {
					os.options[oid] = v;
				} else {
					err = 1;
					DEBUG_PRINTLN(); DEBUG_PRINT(oid); DEBUG_PRINT(" "); DEBUG_PRINT(max_value); DEBUG_PRINT(">");DEBUG_PRINTLN(v);
				}
			}
		}
		if (os.options[oid] != prev_value)  	// if value has changed
		{
			if (oid == OPTION_TIMEZONE || oid == OPTION_USE_NTP)    time_change = true;
			if (oid >= OPTION_NTP_IP1 && oid <= OPTION_NTP_IP4)     time_change = true;
			if (oid >= OPTION_USE_DHCP && oid <= OPTION_HTTPPORT_1) network_change = true;
			if (oid == OPTION_DEVICE_ID)  network_change = true;
			if (oid == OPTION_USE_WEATHER) weather_change = true;
		}
	}

	if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("loc"), true)) {
		urlDecode(tmp_buffer);
		tmp_buffer[MAX_LOCATION - 1] = 0;   // make sure we don't exceed the maximum size
		if (strcmp_to_nvm(tmp_buffer, ADDR_NVM_LOCATION)) { // if location has changed
		
			nvm_write_block(tmp_buffer, (void*)ADDR_NVM_LOCATION, strlen(tmp_buffer) + 1);
			weather_change = true;
		}
	}
	uint8_t keyfound = 0;
	if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("wtkey"), true, &keyfound)) {
		urlDecode(tmp_buffer);
		tmp_buffer[MAX_WEATHER_KEY - 1] = 0;
		if (strcmp_to_nvm(tmp_buffer, ADDR_NVM_WEATHER_KEY)) { // if weather key has changed
		
