pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
			nvm_write_block(tmp_buffer, (void*)ADDR_NVM_WEATHER_KEY, strlen(tmp_buffer) + 1);
			weather_change = true;
		}
	} else if (keyfound) {
		tmp_buffer[0] = 0;
		nvm_write_block(tmp_buffer, (void*)ADDR_NVM_WEATHER_KEY, strlen(tmp_buffer) + 1);
	}
#ifdef OS217
  keyfound = 0;
  if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("ifkey"), true, &keyfound)) {
    urlDecode(tmp_buffer);
    tmp_buffer[TMP_BUFFER_SIZE-1]=0;
///t    write_to_file(ifkey_filename, tmp_buffer, strlen(tmp_buffer));
  } else if (keyfound) {
    tmp_buffer[0]=0;
///t    write_to_file(ifkey_filename, tmp_buffer, strlen(tmp_buffer));
  }  
#endif
	// if not using NTP and manually setting time
	if (!os.options[OPTION_USE_NTP] && findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("ttt"), true)) {
		unsigned long t;
		t = atol(tmp_buffer);
		// before chaging time, reset all stations to avoid messing up with timing
		reset_all_stations_immediate();
#if defined(ARDUINO)
		setTime(t);

		RTC.set(t);

#endif
	}
	if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("wto"), true)) {
		urlDecode(tmp_buffer);
		tmp_buffer[TMP_BUFFER_SIZE] = 0;
		// store weather key
		DEBUG_PRINT("WW_URL "); DEBUG_PRINTLN(tmp_buffer);
		write_to_file(wtopts_filename, tmp_buffer, strlen(tmp_buffer));
		weather_change = true;
	}
	if (err) {
		return HTML_DATA_OUTOFBOUND;
	}

	os.options_save();

	if (time_change) {
		os.status.req_ntpsync = 1;
	}

	if (weather_change) {
		os.checkwt_lasttime = 0;  // force weather update
	}

	if (network_change) {
		// network related options have changed
		// this would require a restart to take effect
	}

	return HTML_SUCCESS;
}

/**
 * Change password
 * Command: /sp?pw=xxx&npw=x&cpw=x
 *
 * pw:  password
 * npw: new password
 * cpw: confirm new password
 */
byte server_change_password(char *p) {
	if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("npw"), true)) {
		char tbuf2[TMP_BUFFER_SIZE];
		if (findKeyVal(p, tbuf2, TMP_BUFFER_SIZE, PSTR("cpw"), true) && strncmp(tmp_buffer, tbuf2, MAX_USER_PASSWORD) == 0) {
#if defined(DEMO)
			return HTML_SUCCESS;
#endif
			urlDecode(tmp_buffer);
			tmp_buffer[MAX_USER_PASSWORD - 1] = 0;  // make sure we don't exceed the maximum size
			nvm_write_block(tmp_buffer, (void*)ADDR_NVM_PASSWORD, strlen(tmp_buffer) + 1);
			return HTML_SUCCESS;
		} else {
			return HTML_MISMATCH;
		}
	}
	return HTML_DATA_MISSING;
}

void server_json_status_main()
{
    bfill.emit_p ( PSTR ( "\"sn\":[" ) );
    byte sid;

    for ( sid=0; sid<os.nstations; sid++ )
    {
        bfill.emit_p ( PSTR ( "$D" ), ( os.station_bits[ ( sid>>3 )]>> ( sid&0x07 ) ) &1 );
        if ( sid!=os.nstations-1 ) bfill.emit_p ( PSTR ( "," ) );
    }
    bfill.emit_p ( PSTR ( "],\"nstations\":$D}" ), os.nstations );
    delay ( 1 );
}

/** Output station status */
byte server_json_status ( char *p )
{
    print_json_header();
    server_json_status_main();
    return HTML_OK;
}

/**
 * Test station (previously manual operation)
 * Command: /cm?pw=xxx&sid=x&en=x&t=x
 *
 * pw: password
 * sid:station name (starting from 0)
 * en: enable (0 or 1)
 * t:  timer (required if en=1)
 */
byte server_change_manual(char *p) {
	int sid = -1;
	if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("sid"), true)) {
		sid = atoi(tmp_buffer);
		if (sid < 0 || sid >= os.nstations) return HTML_DATA_OUTOFBOUND;
	} else {
		return HTML_DATA_MISSING;
	}

	byte en = 0;
	if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("en"), true)) {
		en = atoi(tmp_buffer);
	} else {
		return HTML_DATA_MISSING;
	}

	uint16_t timer = 0;
	unsigned long curr_time = os.now_tz();
	if (en) // if turning on a station, must provide timer
	{
		if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("t"), true)) {
			timer = (uint16_t)atol(tmp_buffer);
			if (timer == 0 || timer > 64800) {
				return HTML_DATA_OUTOFBOUND;
			}
			// schedule manual station
			// skip if the station is a master station
			// (because master cannot be scheduled independently)
			byte bid = sid >> 3;
			byte s = sid & 0x07;
			if ((os.status.mas == sid + 1) || (os.status.mas2 == sid + 1))
				return HTML_NOT_PERMITTED;

			RuntimeQueueStruct *q = NULL;
			byte sqi = pd.station_qid[sid];
			// check if the station already has a schedule
			if (sqi != 0xFF)  // if we, we will overwrite the schedule
			{
				q = pd.queue + sqi;
			} else      // otherwise create a new queue element
			{
				q = pd.enqueue();
			}
			// if the queue is not full
			if (q) {
				q->st = 0;
				q->dur = timer;
				q->sid = sid;
				q->pid = 99;  // testing stations are assigned program index 99
				schedule_all_stations(curr_time);
			} else {
				return HTML_NOT_PERMITTED;
			}
		} else {
			return HTML_DATA_MISSING;
		}
	} else      // turn off station
	{
		turn_off_station(sid, curr_time);
	}
	return HTML_SUCCESS;
}

/**
 * Get log data
 * Command: /jl?start=x&end=x&hist=x&type=x
 *
 * hist:  history (past n days)
 *        when hist is speceified, the start
 *        and end parameters below will be ignored
 * start: start time (epoch time)
 * end:   end time (epoch time)
 * type:  type of log records (optional)
 *        rs, rd, wl
 *        if unspecified, output all records
 */
byte server_json_log(char *p) {

#if defined(ARDUINO)
	// if no sd card, return false
	if (!os.status.has_sd)  return HTML_PAGE_NOT_FOUND;
#endif

	unsigned int start, end;

	// past n day history
	if (findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("hist"), true)) {
		int hist = atoi(tmp_buffer);
		if (hist < 0 || hist > 365) return HTML_DATA_OUTOFBOUND;
		end = os.now_tz() / 86400L;
		start = end - hist;
	} else {
		if (!findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("start"), true))
			return HTML_DATA_MISSING;
		start = atol(tmp_buffer) / 86400L;

		if (!findKeyVal(p, tmp_buffer, TMP_BUFFER_SIZE, PSTR("end"), true))
			return HTML_DATA_MISSING;
		end = atol(tmp_buffer) / 86400L;

		// start must be prior to end, and can't retrieve more than 365 days of data
		if ((start > end) || (end - start) > 365)  return HTML_DATA_OUTOFBOUND;
	}

