pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
	// extract the type parameter
	char type[4] = { 0 };
	bool type_specified = false;
	if (findKeyVal(p, type, 4, PSTR("type"), true))
		type_specified = true;

	print_json_header(false);
	bfill.emit_p(PSTR("["));

	bool comma = 0;
	for (int i = start; i <= end; i++) {
		itoa(i, tmp_buffer, 10);

		make_logfile_name(tmp_buffer);

#if defined(ARDUINO)  // prepare to open log file for Arduino
#if !defined(ESP8266) && !defined(ESP32)
		if (!sd.exists(tmp_buffer)) continue;
		SdFile file;
		file.open(tmp_buffer, O_READ);
#else //ESP8266
		memmove(tmp_buffer + 1, tmp_buffer, strlen(tmp_buffer) + 1); tmp_buffer[0] = '/';
		if (!SPIFFS.exists(tmp_buffer)) {
			DEBUG_PRINT("not found"); DEBUG_PRINTLN(tmp_buffer); continue;
		}
		File file = SPIFFS.open(tmp_buffer, "r");
#endif
#else // prepare to open log file for RPI/BBB
		FILE *file;
		file = fopen(get_filename_fullpath(tmp_buffer), "rb");
		if (!file) continue;
#endif // prepare to open log file

		int res;
		while (true) {
#if defined(ARDUINO)
#if !defined(ESP8266) && !defined(ESP32)
			res = file.fgets(tmp_buffer, TMP_BUFFER_SIZE);
#else
			res = file.readBytesUntil('\n', tmp_buffer, TMP_BUFFER_SIZE);
			tmp_buffer[res] = 0;
			DEBUG_PRINT("Log>"); DEBUG_PRINT(res); DEBUG_PRINT('=');  DEBUG_PRINTLN(tmp_buffer);
#endif
			if (res <= 0) {
				file.close();
				break;
			}
#else
			if (fgets(tmp_buffer, TMP_BUFFER_SIZE, file)) {
				res = strlen(tmp_buffer);
			} else {
				res = 0;
			}
			if (res <= 0) {
				fclose(file);
				break;
			}
#endif
			// check record type
			// records are all in the form of [x,"xx",...]
			// where x is program index (>0) if this is a station record
			// and "xx" is the type name if this is a special record (e.g. wl, fl, rs)
			// search string until we find the first comma
			char *ptype = tmp_buffer;
			tmp_buffer[TMP_BUFFER_SIZE - 1] = 0; // make sure the search will end
			while (*ptype && *ptype != ',') ptype++;
			//DEBUG_PRINTLN(type_specified);
			if (*ptype != ',') continue; // didn't find comma, move on
			ptype++;  // move past comma
			//DEBUG_PRINTLN(type);
			if (type_specified && strncmp(type, ptype + 1, 2))
				continue;
			// if type is not specified, output everything except "wl" and "fl" records
			if (!type_specified && (!strncmp("wl", ptype + 1, 2) || !strncmp("fl", ptype + 1, 2)))
				continue;
			DEBUG_PRINT("OK");
			// if this is the first record, do not print comma
			if (comma)  bfill.emit_p(PSTR(","));
			else {
				comma = 1;
			}
			bfill.emit_p(PSTR("$S"), tmp_buffer);
			DEBUG_PRINTLN(tmp_buffer);
			// if the available ether buffer size is getting small
			// push out a packet
			if (available_ether_buffer() < 80) {
				send_packet();
			}
		}
	}

	bfill.emit_p( /*PSTR*/ ("]"));
	delay(1);
	return HTML_OK;
}
/**
 * Delete log
 * Command: /dl?pw=xxx&day=xxx
 *          /dl?pw=xxx&day=all
 *
 * pw: password
 * day:day (epoch time / 86400)
 * if day=all: delete all log files)
 */
byte server_delete_log ( char *p )
{

    if ( !findKeyVal ( p, tmp_buffer, TMP_BUFFER_SIZE, PSTR ( "day" ), true ) )
        return HTML_DATA_MISSING;

    delete_log ( tmp_buffer );

    return HTML_SUCCESS;
}

/** Output all JSON data, including jc, jp, jo, js, jn */
byte server_json_all(char *p) {
	print_json_header();
	bfill.emit_p(PSTR("\"settings\":{"));
	server_json_controller_main();
	send_packet();
	bfill.emit_p(PSTR(",\"programs\":{"));
	server_json_programs_main();
	send_packet();
	bfill.emit_p(PSTR(",\"options\":{"));
	server_json_options_main();
	send_packet();
	bfill.emit_p(PSTR(",\"status\":{"));
	server_json_status_main();
	send_packet();
	bfill.emit_p(PSTR(",\"stations\":{"));
	server_json_stations_main();
	bfill.emit_p(PSTR("}"));
	delay(1);
	return HTML_OK;
}

typedef byte ( *URLHandler ) ( char* );
/*struct URLStruct{
  PGM_P PROGMEM url;

};*/


/* Server function urls
 * To save RAM space, each GET command keyword is exactly
 * 2 characters long, with no ending 0
 * The order must exactly match the order of the
 * handler functions below
 */
const char _url_keys[] /*PROGMEM*/ =
    "cv"
    "jc"
    "dp"
    "cp"
    "cr"
#ifdef OS217
  "mp"
#endif
    "up"
    "jp"
    "co"
    "jo"
    "sp"
    "js"
    "cm"
    "cs"
    "jn"
    "je"
    "jl"
    "dl"
    "su"
    "cu"
    "ja";

// Server function handlers
URLHandler urls[] =
{
    server_change_values,   // cv
    server_json_controller, // jc
    server_delete_program,  // dp
    server_change_program,  // cp
    server_change_runonce,  // cr
#ifdef OS217
    server_manual_program,  // mp  
#endif
    server_moveup_program,  // up
    server_json_programs,   // jp
    server_change_options,  // co
    server_json_options,    // jo
    server_change_password, // sp
    server_json_status,     // js
    server_change_manual,   // cm
    server_change_stations, // cs
    server_json_stations,   // jn
    server_json_station_special,// je
    server_json_log,        // jl
    server_delete_log,      // dl
    server_view_scripturl,  // su
    server_change_scripturl,// cu
    server_json_all         // ja
};

// handle Ethernet request
void handle_web_request(char *p) {
#if defined(ARDUINO)
	ether.httpServerReplyAck();
#endif
	rewind_ether_buffer();

	// assume this is a GET request
	// GET /xx?xxxx
	char *com = p + 5;
	char *dat = com + 3;
	DEBUG_PRINT("web req "); DEBUG_PRINT(com[0]); DEBUG_PRINTLN(com[1]);
	if (com[0] == ' ' || com[0] == 0) {
		DEBUG_PRINTLN("home page");
		server_home();  // home page handler
		send_packet(true);

	} else {
		// server funtion handlers
		byte i;
		for (i = 0; i < sizeof(urls) / sizeof(URLHandler); i++) {
			if (pgm_read_byte(_url_keys + 2 * i) == com[0]
				&& pgm_read_byte(_url_keys + 2 * i + 1) == com[1]) {

				// check password
				byte ret = HTML_UNAUTHORIZED;

				if (com[0] == 's' && com[1] == 'u') // for /su do not require password
				{
					ret = (urls[i]) (dat);
				} else if ((com[0] == 'j' && com[1] == 'o') ||
					(com[0] == 'j' && com[1] == 'a')) // for /jo and /ja we output fwv if password fails
				{
					if (check_password(dat) == false) {
						print_json_header();
						bfill.emit_p(PSTR("\"$F\":$D}"),
							op_json_names + 0, os.options[0]);
						ret = HTML_OK;
					} else {
						ret = (urls[i]) (dat);
					}
				} else {
					// first check password
					if (check_password(dat) == false) {
						ret = HTML_UNAUTHORIZED;
					} else {
						ret = (urls[i]) (dat);
					}
				}
				DEBUG_PRINT("ret="); DEBUG_PRINT(ret);
				switch (ret) {
				case HTML_OK:
					break;
				case HTML_REDIRECT_HOME:
					print_html_standard_header();
					bfill.emit_p(PSTR("$F"), htmlReturnHome);
					break;
				default:
					print_json_header();
					bfill.emit_p(PSTR("\"result\":$D}"), ret);
				}
				break;
			}
		}

		if (i == sizeof(urls) / sizeof(URLHandler)) {
			DEBUG_PRINTLN("no server function");
			// no server funtion found
			print_json_header();
			bfill.emit_p(PSTR("\"result\":$D}"), HTML_PAGE_NOT_FOUND);
		}
		send_packet(true);
	}
	//delay(50); // add a bit of delay here
}

/*--------NEW NTP code ----------*/
WiFiUDP Udp;

//const int NTP_PACKET_SIZE = 48; // NTP time is in the first 48 bytes of message
    byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets
									// send an NTP request to the time server at the given address
	void sendNTPpacket(IPAddress &address) {
	memset(packetBuffer, 0, NTP_PACKET_SIZE);
	// Initialize values needed to form NTP request
	// (see URL above for details on the packets)
	packetBuffer[0] = 0b11100011;   // LI, Version, Mode
	packetBuffer[1] = 0;     // Stratum, or type of clock
	packetBuffer[2] = 6;     // Polling Interval
	packetBuffer[3] = 0xEC;  // Peer Clock Precision
							 // 8 bytes of zero for Root Delay & Root Dispersion
	packetBuffer[12] = 49;
	packetBuffer[13] = 0x4E;
	packetBuffer[14] = 49;
	packetBuffer[15] = 52;
	// all NTP fields have been given values, now
	// you can send a packet requesting a timestamp:                 
	Udp.beginPacket(address, 123); //NTP requests are to port 123
	Udp.write(packetBuffer, NTP_PACKET_SIZE);
	Udp.endPacket();
}
	time_t getNtpTime() {
		Udp.begin(8888); DEBUG_PRINTLN(WiFi.dnsIP());
		byte itry = 0;
		while (itry++ < 20) {

