pbecchi/ESP32-Sprinkler/OpenSprinklerServer.cpp
			IPAddress timeServer;
			WiFi.hostByName("time.nist.gov", timeServer);
			Serial.println(timeServer);
			//		if (!ether.HOSTname(timeServer, "time.nist.gov")) {
			//			timeServer = IPAddress(os.options[OPTION_NTP_IP1],
			//									os.options[OPTION_NTP_IP2],
			//									os.options[OPTION_NTP_IP3],
			//									os.options[OPTION_NTP_IP4]);
			//		}
			//		Serial.println(timeServer);
			Serial.println("waiting for sync");
			while (Udp.parsePacket() > 0); // discard any previously received packets
			Serial.println("Transmit NTP Request");
			sendNTPpacket(timeServer);
			uint32_t beginWait = millis();
			while (millis() - beginWait < 5000) {
				int size = Udp.parsePacket();
				if (size >= NTP_PACKET_SIZE) {
					Serial.println("Receive NTP Response");
					Udp.read(packetBuffer, NTP_PACKET_SIZE);  // read packet into the buffer
					unsigned long secsSince1900;
					// convert four bytes starting at location 40 to a long integer
					secsSince1900 = (unsigned long)packetBuffer[40] << 24;
					secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
					secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
					secsSince1900 |= (unsigned long)packetBuffer[43];
					return secsSince1900 - 2208988800UL;// +timeZone * SECS_PER_HOUR;
				}
			}
		}
		Serial.println("No NTP Response :-(");
		return 0; // return 0 if unable to get the time
	}




#if defined(ARDUINOc)
/** NTP sync request */
time_t getNtpTime()
{
	byte ntpip[4] =
	{
		os.options[OPTION_NTP_IP1],
		os.options[OPTION_NTP_IP2],
		os.options[OPTION_NTP_IP3],
		os.options[OPTION_NTP_IP4]
	};
	uint32_t time;
	byte tick = 0;
	unsigned long expire;
	IPAddress serverIp(ntpip[0], ntpip[1], ntpip[2], ntpip[3]);

	do
	{
		for (byte i = 0; i < 3; i++)
			ntpip[i] = serverIp[i];
		ether.ntpRequest(ntpip, ntpclientportL);
		expire = millis() + 4000; // wait for at most 4 second  
		do
		{
			word len = ether.packetReceive();
			ether.packetLoop(len);
			if (len > 0 && ether.ntpProcessAnswer(&time, ntpclientportL))

				//			word len = ether.Udp_parsePacket();
							//DEBUG_PRINTLN(len);
				//error was on the vodafone server port forwarding
					//		if(len>=48&& ether.ntpProcessAnswer(&time, ntpclientportL)) //min.legth 48 bytes

			{
				if ((time & 0x80000000UL) == 0)
				{
					time += 2085978496;
				}
				else
				{
					time -= 2208988800UL;
				}
				return time;
			}

		} while (millis() < expire);
		tick++;
		WiFi.hostByName("time.nist.gov", serverIp);
	} while (tick < 20);
	return 0;
}
#endif
